Description: |
  Downloads the current release version of AdoptOpenJDK 8 JRE. This is based from the tar version rather 
  than the signed pkg version, so that the true version number can be obtained.

  The default JVM implementation is "hotspot". To override to "openj9", change the value of JVM_IMPLEMENTATION.

  The default Release Type is "releases", which is the stable build. To get the most recent build, select "nightly".
Identifier: com.github.grahampugh.recipes.download.AdoptOpenJDK8JRE
MinimumVersion: "2.3"

Input:
  NAME: AdoptOpenJDK 8 JRE
  JVM_IMPLEMENTATION: hotspot
  RELEASE_STREAM: releases
  STOPPROCESSINGIF_PREDICATE: download_changed == False

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: binary_link.*?(?P<match>AdoptOpenJDK.*?\/OpenJDK8U-jdk_x64_mac_%JVM_IMPLEMENTATION%_.*?\.tar\.gz)
      url: https://api.adoptopenjdk.net/v2/latestAssets/%RELEASE_STREAM%/openjdk8?os=mac&arch=x64&heap_size=normal&openjdk_impl=%JVM_IMPLEMENTATION%&type=jre

  - Processor: URLDownloader
    Arguments:
      url: https://github.com/%match%

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Comment: Checks if the file already exists in the cache
    Arguments:
      predicate: "%STOPPROCESSINGIF_PREDICATE%"
