Description: |
  Downloads the current release version of AdoptOpenJDK 11. This is based from the tar version rather 
  than the signed pkg version, so that the true version number can be obtained.

  The default JVM implementation is "hotspot". To override to "openj9", change the value of JVM_IMPLEMENTATION.

  The default Release Type is "releases", which is the stable build. To get the most recent build, select "nightly".
Identifier: com.github.grahampugh.recipes.download.AdoptOpenJDK11
MinimumVersion: "2.3"

Input:
  NAME: AdoptOpenJDK 11
  JVM_IMPLEMENTATION: hotspot
  RELEASE_STREAM: releases

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: binary_link.*?(?P<match>AdoptOpenJDK.*?\/OpenJDK11U-jdk_x64_mac_%JVM_IMPLEMENTATION%_.*?\.tar\.gz)
      url: https://api.adoptopenjdk.net/v2/latestAssets/%RELEASE_STREAM%/openjdk11?os=mac&arch=x64&heap_size=normal&openjdk_impl=%JVM_IMPLEMENTATION%&type=jdk

  - Processor: URLDownloader
    Arguments:
      url: https://github.com/%match%

  - Processor: EndOfCheckPhase
