Comment: Recipe automatically generated from com.github.jss-recipes.jss.VisualStudioCode by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.VisualStudioCode-pkg-upload
ParentRecipe: com.github.killahquam.pkg.visualstudioscode
MinimumVersion: '2.3'

Input:
  NAME: Visual Studio Code
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
