Comment: Recipe automatically generated from com.github.novaksam.jss.XQuartz by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.XQuartz-pkg-upload
ParentRecipe: com.github.scriptingosx.pkg.XQuartz
MinimumVersion: '2.3'

Input:
  NAME: XQuartz
  CATEGORY: Plugins and Frameworks

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
