Description: Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.grahampugh.recipes.jamf.MAU-profile
MinimumVersion: '2.3'

Input:
  NAME: MAU Custom Settings
  INSTALLED_GROUP_NAME: Microsoft Office 365 installed
  JSS_INVENTORY_NAME: Microsoft Word.app
  MOBILECONFIG: MAU-custom-settings.mobileconfig
  PROFILE_CATEGORY: Applications
  PROFILE_GROUP_TEMPLATE: SmartGroup-application-installed.xml
  PROFILE_NAME: '%NAME%'
  PROFILE_TEMPLATE: Profile-single-group.xml
  REPLACE_PROFILE: 'False'

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%PROFILE_CATEGORY%'
    replace_category: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%INSTALLED_GROUP_NAME%'
    computergroup_template: '%PROFILE_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
  Arguments:
    mobileconfig: '%MOBILECONFIG%'
    profile_category: '%PROFILE_CATEGORY%'
    profile_computergroup: '%INSTALLED_GROUP_NAME%'
    profile_name: '%PROFILE_NAME%'
    profile_template: '%PROFILE_TEMPLATE%'
    replace_profile: '%REPLACE_PROFILE%'
