Description: Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.grahampugh.recipes.jamf.VLC-profile
MinimumVersion: '2.3'

Input:
  NAME: VLC settings
  IDENTIFIER: org.videolan.vlc
  INSTALLED_GROUP_NAME: VLC installed
  JSS_INVENTORY_NAME: VLC.app
  ORGANIZATION: AutoPkg
  PROFILE_CATEGORY: Applications
  PROFILE_DESCRIPTION: Disables automatic updates and prevents sending telemetry.
  PROFILE_GROUP_TEMPLATE: SmartGroup-application-installed.xml
  PROFILE_NAME: '%NAME%'
  PROFILE_PAYLOAD: '%IDENTIFIER%.plist'
  PROFILE_TEMPLATE: Profile-single-group.xml
  REPLACE_PROFILE: 'True'

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%PROFILE_CATEGORY%'
    replace_category: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%INSTALLED_GROUP_NAME%'
    computergroup_template: '%PROFILE_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
  Arguments:
    identifier: '%IDENTIFIER%'
    organization: '%ORGANIZATION%'
    payload: '%PROFILE_PAYLOAD%'
    profile_category: '%PROFILE_CATEGORY%'
    profile_computergroup: '%INSTALLED_GROUP_NAME%'
    profile_description: '%PROFILE_DESCRIPTION%'
    profile_name: '%PROFILE_NAME%'
    profile_template: '%PROFILE_TEMPLATE%'
    replace_profile: '%REPLACE_PROFILE%'
