Description: Downloads the latest release of Unison.
Identifier: com.github.grahampugh.recipes.download.unison
MinimumVersion: "2.3"

Input:
  NAME: Unison
  STOPPROCESSINGIF_PREDICATE: download_changed == FALSE

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: bcpierce00/unison

  - Processor: URLDownloader

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%STOPPROCESSINGIF_PREDICATE%"
