Description: Downloads the current version of LogitechPresentation.
Identifier: com.github.grahampugh.recipes.download.LogitechPresentation
MinimumVersion: "2.3"

Input:
  NAME: Logitech Presentation
  STOPPROCESSINGIF_PREDICATE: download_changed == FALSE

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (?P<url>https:\/\/download01\.logi\.com\/web\/ftp\/pub\/techsupport\/presentation\/LogiPresentation_(?P<version>.*?)\.dmg)
      url: https://www.logitech.com/en-gb/product/spotlight-presentation-remote/page/spotlight-features
      user-agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/69.0.3497.100 Safari/537.36

  - Processor: URLDownloader
    Arguments:
      url: "%url%"

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%STOPPROCESSINGIF_PREDICATE%"

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/LogiPresentation Installer.app"
      requirement: identifier "com.logitech.presenter.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QED4VVPZWA
