Description: Downloads the latest version of DataWarrior.
Identifier: com.github.grahampugh.download.DataWarrior
MinimumVersion: "2.3"

Input:
  NAME: DataWarrior
  DOWNLOAD_URL: http://www.openmolecules.org/datawarrior/download.html

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (?P<match>http.*?dmg\?dl=1)
      url: "%DOWNLOAD_URL%"

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.dmg"
      url: "%match%"

  - Processor: EndOfCheckPhase
