Description: Downloads latest FileMaker Pro updater disk image and extracts the package from within. This will only work for versions 19 and above.
Identifier: com.github.grahampugh.recipes.download.FileMakerPro

Input:
  NAME: FileMaker Pro
  MAJOR_VERSION: "19"
  STOPPROCESSINGIF_PREDICATE: download_changed == FALSE

Process:
  - Processor: FileMakerProURLProcessor
    Arguments:
      major_version: "%MAJOR_VERSION%"

  - Processor: URLDownloader
    Arguments:
      url: https://downloads.claris.com/esd/fmp_%version%.dmg

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%STOPPROCESSINGIF_PREDICATE%"
