Description: Placeholder pkg recipe - just moves the pkg to create the pkg_path variable.
Identifier: com.github.grahampugh.recipes.pkg.Nudge
ParentRecipe: com.github.erikng.download.Nudge
MinimumVersion: "2.3"

Input:
  NAME: Nudge

Process:
  - Arguments:
      source_pkg: "%pathname%"
    Processor: com.github.grahampugh.recipes.commonprocessors/PkgInfoReader

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/Nudge-%version%.pkg"
      source_pkg: "%pathname%"
